In [5]:
import pandas as pd

* nba cvs dosyasını okutalım

In [6]:
df=pd.read_csv("nba.csv")

* ilk 5 kaydı getirelim

In [7]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

* genel bilgilerine bakalım

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [13]:
df["Salary"].isnull().sum()

12

In [14]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Number,457.0,1.767834e+01,1.596609e+01,0.0,5.00,13.0,25.0,99.0
Age,457.0,2.693873e+01,4.404016e+00,19.0,24.00,26.0,30.0,40.0
Weight,457.0,2.215230e+02,2.636834e+01,161.0,200.00,220.0,240.0,307.0
Salary,446.0,4.842684e+06,5.229238e+06,30888.0,1044792.25,2839073.0,6500000.0,25000000.0

* tüm oyuncuların maaş ortalamasını bulalım

In [15]:
df["Salary"].mean()

4842684.105381166

* en yüksek-en düşük maaş ne kadar

In [16]:
df["Salary"].max()

25000000.0

In [17]:
df["Salary"].min()

30888.0

* en yüksek maaşı alan oyuncu kim

In [18]:
df[df["Salary"]==df["Salary"].max()]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0

* en düşük maaş alan oyuncu kim

In [19]:
df[df["Salary"]==df["Salary"].min()]

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
32,Thanasis Antetokounmpo,New York Knicks,43.0,SF,23.0,6-7,205.0,NaN,30888.0

* Yaşı 20-25 arasında olan oyuncuların isim ve oynadıkları takımları azalan şekilde sıralı

In [20]:
df[(df["Age"]>20)&(df["Age"]<25)][["Name","Age","Team"]].sort_values("Age",ascending=False)

                 Name   Age                Team
239     Dwight Powell  24.0    Dallas Mavericks
252    Terrence Jones  24.0     Houston Rockets
317   Lamar Patterson  24.0       Atlanta Hawks
316      Mike Muscala  24.0       Atlanta Hawks
310  Tim Hardaway Jr.  24.0       Atlanta Hawks
..                ...   ...                 ...
115     Julius Randle  21.0  Los Angeles Lakers
390      Nikola Jokic  21.0      Denver Nuggets
389       Gary Harris  21.0      Denver Nuggets
328    Aaron Harrison  21.0   Charlotte Hornets
125    Archie Goodwin  21.0        Phoenix Suns

[133 rows x 3 columns]

* Amir Johnson isimli oyuncu hangi takımda oynuyor.

In [23]:
df[df["Name"]=="Amir Johnson"]["Team"].iloc[0]

'Boston Celtics'

* Takımlara göre oyuncuların ortalama maaş bilgisi nedir ?

In [26]:
df.groupby(["Team"])["Salary"].agg(["mean"])

                                mean
Team
Atlanta Hawks           4.860197e+06
Boston Celtics          4.181505e+06
Brooklyn Nets           3.501898e+06
Charlotte Hornets       5.222728e+06
Chicago Bulls           5.785559e+06
Cleveland Cavaliers     7.642049e+06
Dallas Mavericks        4.746582e+06
Denver Nuggets          4.294424e+06
Detroit Pistons         4.477884e+06
Golden State Warriors   5.924600e+06
Houston Rockets         5.018868e+06
Indiana Pacers          4.450122e+06
Los Angeles Clippers    6.323643e+06
Los Angeles Lakers      4.784695e+06
Memphis Grizzlies       5.467920e+06
Miami Heat              6.347359e+06
Milwaukee Bucks         4.350220e+06
Minnesota Timberwolves  4.593054e+06
New Orleans Pelicans    4.355304e+06
New York Knicks         4.581494e+06
Oklahoma City Thunder   6.251020e+06
Orlando Magic           4.297248e+06
Philadelphia 76ers      2.213778e+06
Phoenix Suns            4.229676e+06
Portland Trail Blazers  3.220121e+06
Sacramento Kings        4.778911e+06
San Antonio Spurs       5.629516e+06
Toronto Raptors         4.741174e+06
Utah Jazz               4.204006e+06
Washington Wizards      5.088576e+06

* Kaç farklı takım mevcut ?

In [28]:
df["Team"].nunique()

30

* Her takımda kaç oyuncu oynamaktadır ?

In [29]:
df["Team"].value_counts()

New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Boston Celtics            15
Brooklyn Nets             15
Portland Trail Blazers    15
Oklahoma City Thunder     15
Denver Nuggets            15
Washington Wizards        15
Miami Heat                15
Charlotte Hornets         15
Atlanta Hawks             15
San Antonio Spurs         15
Houston Rockets           15
Dallas Mavericks          15
Indiana Pacers            15
Detroit Pistons           15
Cleveland Cavaliers       15
Chicago Bulls             15
Sacramento Kings          15
Phoenix Suns              15
Los Angeles Lakers        15
Los Angeles Clippers      15
Golden State Warriors     15
Toronto Raptors           15
Philadelphia 76ers        15
Utah Jazz                 15
Orlando Magic             14
Minnesota Timberwolves    14
Name: Team, dtype: int64